[  
  {
    "id": "kie_hardlightchrysalis",
    "name": "HARDLIGHT CHRYSALIS",
    "source": "KIE",
    "effect": "<p>Choose one of your mech skills, you gain +1 Accuracy on all checks and saves made with that skill. You can change the chosen skill on a rest or full repair.</p><p>&nbsp;Additionally, whenever you rest or perform a full repair, your mech projects a faint field of protective energy within a burst 6 area, shielding you and your nearby allies from any dangerous weather conditions and other effects originating outside the area. No effect, attack or character can pass through the shield unless you allow it, and you can control the conditions inside this area however you please (temperature, moisture, light level, etc). When the scene ends or if you boot up your mech, the field dissipates. This field cannot be activated in any way during combat.</p>",
    "description": "<p>Designed to accompany Rubbleborn pioneers in more hazardous conditions, the Hardlight Chrysalis creates a protective “shell” that can turn any hostile environment into a suitable atmosphere with comfortable conditions. The power required to keep this field up, added to the necessity of exposing most of the frame's inner systems, creates a considerable risk when deploying the chrysalis. Because of this, it cannot be activated during high-intensity or combat situations.</p>",
    "mounted_effect": "",
    "actions": [],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  },
  {
    "id": "KIE_AVS",
    "name": " ARTIFICIAL VASCULAR SYSTEMS",
    "source": "KIE",
    "effect": "<p>As a Protocol, you may take 3 Heat to regain a number of Hit Points equal to your GRIT. This amount can never bring you above half HP.</p>",
    "description": "<p>Rubblefolk technology blends the biological with the mechanical. Mechs of their design often have their own organs, including hearts, kidneys, and musculature made from nanites.</p>",
    "mounted_effect": "",
    "actions": [
      {
        "name": "Activate Artificial Vascular Systems",
        "activation": "Protocol",
        "detail": "<p>As a Protocol, you may take 3 Heat to regain a number of Hit Points equal to your GRIT. This amount can never bring you above half HP.</p>",
        "cost": "3",
        "pilot": false,
        "damage": [],
        "range": [],
        "synergy_locations": [
          "scan"
        ],
        "tech_attack": false,
        "frequency": "Unlimited",
        "init": "",
        "trigger": ""
      }
    ],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  },
  {
    "id": "kie_motherlode",
    "name": "MOTHERLOAD MUNITIONS",
    "source": "KIE",
    "effect": "<p>When you consume Lock-On on a weapon attack, you deal +1d6 AP Bonus Damage. This bonus damage cannot be reduced in any manner. Afterwards, take Heat equal to half the amount of Bonus Damage dealt by this core Bonus.</p>",
    "description": "<p>Designed for mining usage, “Motherload Munitions” are capable of breaking apart tough ore veins. Rubbleborn teams deployed to Zott have been known to use them to crack asteroids.</p>",
    "mounted_effect": "",
    "actions": [],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  },
  {
    "id": "kie_dni",
    "name": "DIRECT NEURAL INTERFACE",
    "source": "KIE",
    "effect": "<p>While your Mech is STUNNED:</p><p>- You may take 2 heat to perform a quick action<br>- Your evasion is halved (to a minimum of 5), instead of being reduced to 5.<br>- Your speed is halved (minimum of 1), but you take 1 heat per space moved.</p>",
    "description": "<p>A mech is more than just a machine to a Rubbleborn; Originally life-support equipment for the gestalt beings, these were for all intents and purposes their bodies. After the creation of Ambulatory Cores, some Rubbleborn retained this attitude, and continued to create advanced neural interfaces for use by non-Rubbleborn pilots. Similar to a Full-Subjectivity Sync used by SSC, the DNI allows a pilot’s brain to directly control their mech, even overriding safety protocols in an “Adrenaline Mode”.</p>",
    "mounted_effect": "",
    "actions": [],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  },
  {
    "id": "kie_sps",
    "name": "SELF-PERPETUATING SYSTEMS",
    "source": "KIE",
    "effect": "<p>Designed for deep-core and deep-space operations, modifications of specialized nano-cells can allow a component to be regrown rapidly. The system requires extreme amounts of backup energy and material, but proves to be essential on month-long missions outside of established supply networks.</p>",
    "description": "<p>Choose one system or weapon. If it is destroyed, it is automatically repaired at the end of the Scene for no Repair cost. This can only occur an amount of times equal to half your GRIT each mission, and occurs even when rebuilding a Destroyed mech. If the system is a Deployable or Drone, and the Deployable or Drone was damaged or destroyed, it is automatically restored to full HP at the end of the scene. This does not count against the times Self-Perpetuating Systems can trigger.
</p>",
    "mounted_effect": "",
    "actions": [],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  },
  {
    "id": "kie_cim",
    "name": "COLONY INTERFACE MODULES",
    "source": "KIE",
    "effect": "<p>At the start of a mission or after a Full Repair, choose one weapon and one system that currently do not have the “Eusocial” Tag. These gain the “Eusocial” Tag until your next Full Repair.</p><p>Additionally, all of your “Eusocial” weapons or systems can be activated by allies within Range 5 and Line of Sight.</p>",
    "description": "<p>&lt;placeholder flavor text&gt;</p>",
    "mounted_effect": "",
    "actions": [],
    "bonuses": [],
    "synergies": [],
    "deployables": [],
    "counters": [],
    "integrated": [],
    "special_equipment": []
  }
]
